* ============================================================
* PROGRAM : MANIFEST
* PURPOSE : Generate passenger manifest for a flight
* ============================================================
DEFINE DATA LOCAL
1 FS VIEW OF FLIGHT-SCHEDULE
1 BK VIEW OF BOOKING
1 PA VIEW OF PASSENGER
1 #FLIGHT-KEY    (A20)
1 #MANIFEST-FIL  (A40)
1 #LINE          (A132)
1 #SEQ           (P4)
1 #TOTAL-PAX     (P4)
END-DEFINE

INPUT 'FLIGHT KEY:' #FLIGHT-KEY

FIND FLIGHT-SCHEDULE WITH FS-FLIGHT-KEY = #FLIGHT-KEY
  COMPRESS '/aros/manifests/' #FLIGHT-KEY '.txt' INTO #MANIFEST-FIL
  DEFINE WORK FILE 4 #MANIFEST-FIL
  COMPRESS 'MANIFEST - ' #FLIGHT-KEY ' - ' *DATX
    ' - ' *TIMX INTO #LINE
  WRITE WORK FILE 4 #LINE
  WRITE WORK FILE 4 ' '
  WRITE WORK FILE 4 'SEAT  PNR      NAME                 CLASS  SSR'
  WRITE WORK FILE 4 '--------------------------------------------------------'

  RESET #SEQ #TOTAL-PAX
  FIND BOOKING WITH BK-SEG-FLIGHT-KEY(1) = #FLIGHT-KEY
                AND BK-BOOKING-STATUS = 'HK'
    ADD 1 TO #SEQ
    GET PASSENGER BK-PASSENGER-ID
    COMPRESS '    ' BK-SEG-SEAT-NUMBER(1) '  '
      BK-PNR-LOCATOR ' ' PA-LAST-NAME ',' PA-FIRST-NAME ' '
      BK-SEG-CABIN-CLASS(1) '    ' BK-SSR-CODE(1) INTO #LINE
    WRITE WORK FILE 4 #LINE
    ADD 1 TO #TOTAL-PAX
  END-FIND

  WRITE WORK FILE 4 ' '
  COMPRESS 'TOTAL PASSENGERS: ' #TOTAL-PAX INTO #LINE
  WRITE WORK FILE 4 #LINE
  CLOSE WORK FILE 4
  WRITE 'MANIFEST CREATED:' #MANIFEST-FIL
        'PASSENGERS:' #TOTAL-PAX
END-FIND
END